## :white_check_mark: Apply Result (main)

[CI link](https://github.com/Shion1305/Shion1305-infra/actions/runs/22971967190)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
oci_identity_compartment.main-compartment: Refreshing state... [id=ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq]
data.oci_core_images.ubuntu_latest: Reading...
oci_kms_vault.main: Refreshing state... [id=ocid1.vault.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrc6p3slv4lvmnljlxljomxbe7opkyleyv4jictsq7zedidplooc3q]
oci_core_vcn.main-vcn: Refreshing state... [id=ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra]
data.oci_core_images.ubuntu_latest: Read complete after 1s [id=CoreImagesDataSource-500077686]
oci_core_network_security_group.k8s-nsg: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-tokyo-1.aaaaaaaareo3ddfn7ljzuyyfungeuweyh2tdfn7b2ty3gvxqmx4ig5equobq]
oci_core_network_security_group.main-nsg: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-tokyo-1.aaaaaaaavrvw7s2foai4nyakfvqq5e74pb2b4bsjwjnpnyrgw3y2narigk3a]
oci_core_security_list.permissive-security-list: Refreshing state... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaax2e22ekjmabsofg5mjg5ab2ofn6f5h7ki2o55d33a5lnpjiil2pq]
oci_core_internet_gateway.main-internet-gateway: Refreshing state... [id=ocid1.internetgateway.oc1.ap-tokyo-1.aaaaaaaaw3dtysi3sctisyiqic4jxduykrhke2eo6dafwrgoqqbpzgung6ma]
oci_core_dhcp_options.main-dhcp-options: Refreshing state... [id=ocid1.dhcpoptions.oc1.ap-tokyo-1.aaaaaaaavdzkksyupctnoqbj2hpo6w63vxtgx227o7hv52kl4nru6bcjvfwa]
oci_kms_key.main: Refreshing state... [id=ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrzskbcgfpswirx3i7sokmf2shh4iadjbgnausysbvrdi7zyjprymq]
oci_core_network_security_group_security_rule.k8s-nsg-egress-rule: Refreshing state... [id=E81293]
oci_core_network_security_group_security_rule.k8s-nsg-ingress-rule: Refreshing state... [id=69ADF9]
oci_core_network_security_group_security_rule.main-nsg-egress-rule: Refreshing state... [id=F542E8]
oci_core_network_security_group_security_rule.main-nsg-ingress-6443: Refreshing state... [id=A329FB]
oci_core_network_security_group_security_rule.main-nsg-ingress-https: Refreshing state... [id=0516DD]
oci_core_network_security_group_security_rule.main-nsg-ingress-http: Refreshing state... [id=91FCC3]
oci_core_network_security_group_security_rule.main-nsg-ingress-ssh: Refreshing state... [id=CF2FDC]
oci_core_network_security_group_security_rule.main-nsg-ingress-4914: Refreshing state... [id=7A16CA]
oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-vcn: Refreshing state... [id=CE19EB]
oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-anywhere: Refreshing state... [id=BF7899]
oci_core_route_table.main-route-table: Refreshing state... [id=ocid1.routetable.oc1.ap-tokyo-1.aaaaaaaa5pv27xf72rg4p54tenysrpi7rzsvmu7laetwnikkmzdbevhmz4la]
oci_core_subnet.main-subnet: Refreshing state... [id=ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq]
module.oci_compute_instance-k8s-proxy.oci_core_instance.this: Refreshing state... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycgsmvzp27gnpd4hs4uom3yscpcri46zddez3qly5evjcq]
module.oci_compute_instance-k8s.oci_core_instance.this: Refreshing state... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycqrbpmpg5ljs6qo33hcfmcll3kbdoukpdbhtoeify2syq]
oci_core_volume.k8s-proxy-block-volume: Refreshing state... [id=ocid1.volume.oc1.ap-tokyo-1.abxhiljrt3w4x762lxkdcu435qaaqasriohds2yjfmsyouoeuylzszwvpzka]
oci_core_volume.k8s-block-volume: Refreshing state... [id=ocid1.volume.oc1.ap-tokyo-1.abxhiljrelnhw4aaloerk6ig3wg2pua6vkwdrzpusxc46g7t2ueitzd4vlja]
oci_core_volume_attachment.k8s-proxy-block-volume-attachment: Refreshing state... [id=ocid1.volumeattachment.oc1.ap-tokyo-1.anxhiljrqiqkkcycz7idtwkg4te3a3wnw2fjbqj34bkskchfzbjoibsixstq]
oci_core_volume_attachment.k8s-block-volume-attachment: Refreshing state... [id=ocid1.volumeattachment.oc1.ap-tokyo-1.anxhiljrqiqkkcycewzaksx3qqcaa5uxqv55w6mcxfvk3b4ly5k72exd75hq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.oci_compute_instance-k8s.oci_core_volume_backup_policy.weekly will be created
  + resource "oci_core_volume_backup_policy" "weekly" {
      + compartment_id     = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + defined_tags       = (known after apply)
      + destination_region = (known after apply)
      + display_name       = "oci_compute_instance-k8s-weekly-backup"
      + freeform_tags      = (known after apply)
      + id                 = (known after apply)
      + time_created       = (known after apply)

      + schedules {
          + backup_type       = "INCREMENTAL"
          + day_of_month      = -1
          + day_of_week       = "SUNDAY"
          + hour_of_day       = 0
          + period            = "ONE_WEEK"
          + retention_seconds = 1814400
          + time_zone         = "UTC"
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci_compute_instance-k8s.oci_core_volume_backup_policy_assignment.boot_volume_backup will be created
  + resource "oci_core_volume_backup_policy_assignment" "boot_volume_backup" {
      + asset_id       = "ocid1.bootvolume.oc1.ap-tokyo-1.abxhiljrswccex2cmpst2j7lz6hckewh2o5u35flmsnx4xkmohxt52llqn5q"
      + id             = (known after apply)
      + policy_id      = (known after apply)
      + time_created   = (known after apply)
      + xrc_kms_key_id = (known after apply)
    }

  # module.oci_compute_instance-k8s-proxy.oci_core_volume_backup_policy.weekly will be created
  + resource "oci_core_volume_backup_policy" "weekly" {
      + compartment_id     = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + defined_tags       = (known after apply)
      + destination_region = (known after apply)
      + display_name       = "oci_compute_instance-k8s-proxy-weekly-backup"
      + freeform_tags      = (known after apply)
      + id                 = (known after apply)
      + time_created       = (known after apply)

      + schedules {
          + backup_type       = "INCREMENTAL"
          + day_of_month      = -1
          + day_of_week       = "SUNDAY"
          + hour_of_day       = 0
          + period            = "ONE_WEEK"
          + retention_seconds = 1814400
          + time_zone         = "UTC"
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci_compute_instance-k8s-proxy.oci_core_volume_backup_policy_assignment.boot_volume_backup will be created
  + resource "oci_core_volume_backup_policy_assignment" "boot_volume_backup" {
      + asset_id       = "ocid1.bootvolume.oc1.ap-tokyo-1.abxhiljrwncelhlanqtd36dmqgrnx43fft4wgtsbfg5ayhnsdpllcr4eunjq"
      + id             = (known after apply)
      + policy_id      = (known after apply)
      + time_created   = (known after apply)
      + xrc_kms_key_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.oci_compute_instance-k8s.oci_core_volume_backup_policy.weekly: Creating...
module.oci_compute_instance-k8s-proxy.oci_core_volume_backup_policy.weekly: Creating...
module.oci_compute_instance-k8s.oci_core_volume_backup_policy.weekly: Creation complete after 1s [id=ocid1.volumebackuppolicy.oc1.ap-tokyo-1.amaaaaaaqiqkkcyadgvy37m675akrc2de45cevu35kj56bzishgyrdrdb6pa]
module.oci_compute_instance-k8s.oci_core_volume_backup_policy_assignment.boot_volume_backup: Creating...
module.oci_compute_instance-k8s-proxy.oci_core_volume_backup_policy.weekly: Creation complete after 1s [id=ocid1.volumebackuppolicy.oc1.ap-tokyo-1.amaaaaaaqiqkkcyamtwj5crqo3v5rxct2qin27276rwxey7thv4fpur7vgoq]
module.oci_compute_instance-k8s-proxy.oci_core_volume_backup_policy_assignment.boot_volume_backup: Creating...
module.oci_compute_instance-k8s.oci_core_volume_backup_policy_assignment.boot_volume_backup: Creation complete after 0s [id=ocid1.volumebackuppolicyassign.oc1.ap-tokyo-1.abxhiljr5waaj6ub2u4yb2d2q7du2f3ycm6wcq4qsg6ua56cjud7wjywhxda]
module.oci_compute_instance-k8s-proxy.oci_core_volume_backup_policy_assignment.boot_volume_backup: Creation complete after 0s [id=ocid1.volumebackuppolicyassign.oc1.ap-tokyo-1.abxhiljrkak6vm5pdabmqf3ktcpflc7oomhj3czn4onyaksf4zfbwd5ux7eq]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>



<!-- github-comment: {"Command":"apply","JobName":"run-terragrunt-apply","PRNumber":70,"Program":"tfcmt","SHA1":"ee02500f600ef22d17a8add1f15113d604cc962d","Target":"main","Vars":{},"WorkflowName":"Run Apply on OCI"} -->